# SplitToposolidFailed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SplitToposolidFailures..::..SplitToposolidFailed Property
BuiltInFailures..::..SplitToposolidFailures Class See Also
---
Split toposolid failed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SplitToposolidFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SplitToposolidFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SplitToposolidFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SplitToposolidFailures Class
Autodesk.Revit.DB Namespace